app/controllers/movies_controller.rb

  def index
     self.ratings
     @sort = params[:sort] ? params[:sort] : @sort
     @ratings = params[:ratings] ? params[:ratings] : @ratings
     @sel_ratings = @ratings ? @ratings.keys : @all_ratings
     @movies = Movie.where(:rating => @sel_ratings).order(@sort)
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'R', 'PG-13', 'PG') ORDER BY release_date