app/controllers/movies_controller.rb

  def index
    if params[:id] == "title_header"
      @movies = Movie.order("title")
      @sort = "title"
    elsif params[:id] == "release_date_header"
      @movies = Movie.order("release_date")
      @sort = "release_date"
    else @movies = Movie.all
---
SELECT "movies".* FROM "movies" ORDER BY title
SELECT "movies".* FROM "movies" ORDER BY release_date
SELECT "movies".* FROM "movies" WHERE ('t')